[{"explain":"piracy","description":"**NO piracy**. Asking for or providing commercial games illegal download links **IS NOT ALLOWED**!\nDiscussing piracy practices is ***also not allowed***.\nThis includes, but is not limited to, asking where to download games and asking for or providing help with pirated copies.\nDownloading a copy of the game that you own from the internet is still piracy (and you'll probably get a modified version that will not work anyway).\nIf you need instructions on how to dump your copy of the game, please read the quickstart guide http://rpcs3.net/quickstart"},{"explain":"AI","description":"We use AI to help with common support issues. If you need more help, please contact a staff member."},{"explain":"bug","description":"You found a bug, please report it to a staff member."},{"explain":"suggestion","description":"You have a suggestion, send your suggestion in the suggestions channel."},{"explain":"setup","description":"You need to setup Destiny to use V4nguard instead of Bungie. You can do this by following the setup guide in `d!pc`, `d!ps3`, `d!ps4`, or `d!xbox`."},{"explain":"RPCS3","description":"RPCS3 is an open source project that emulates a PlayStation 3 console. We use this to port Destiny 1 to PC."},{"explain":"dumping","description":"You need to dump your games from a PS3/Disc. You can find instructions on how to do this in `d!pc`."},{"explain":"60 fps","description":"We currently have no patch to support 60 fps. You can only use 30/25 fps."},{"explain":"cannot install","description":"If your game auto-loops the install stage, this either means you are using a pirated version of Destiny 1 or you have a modified version of Destiny 1. Please redump your game from a PS3/Disc."},{"explain":"cannot start","description":"If your game cannot start on RPCS3, please send us a picture of the RPCS3 screen."},{"explain":"disc validation","description":"To check if your blu-ray disc game was dumped correctly validate your game files by following the instructions here: https://wiki.rpcs3.net/index.php?title=Help:Validating_PlayStation_3_game_dumps#Validating_Blu-ray_disc_games"},{"explain":"rule 1","description":"Be respectful to everyone, regardless of your liking. Treat others the way you want to be treated."},{"explain":"rule 2","description":"Please keep profanity down to a minimum any derogatory language towards other users are not tolerated."},{"explain":"rule 3","description":"Please keep spamming to a minimum. Sending small messages right after another counts as spam. Do not disrupt the chat by spamming."},{"explain":"rule 4","description":"Discord has a rule against NSFW, keep all NSFW content in another discord server. Any NSFW content will count as a instant mute."},{"explain":"rule 5","description":"Please do not advertise your discord servers, videos, or streams. You can only post content in the <#932424229662638090> channel and should have actual value to whatever conversation."},{"explain":"rule 6","description":"Please do not have any offensive names or profile pictures, you will be asked to change them."},{"explain":"rule 7","description":"Raiding this server or mentioning raiding will automatically issue a 14 day ban."},{"explain":"rule 8","description":"Any threats such as DDoS, Death, DoX, abuse, or other malicious threats are prohibited and will be reported to the Discord Support Team."},{"explain":"rule 9","description":"Follow the Discord ToS here: https://discord.com/guidelines/"},{"explain":"rule 10","description":"**NO piracy**. Asking for or providing commercial games illegal download links **IS NOT ALLOWED**!\nDiscussing piracy practices is ***also not allowed***.\nThis includes, but is not limited to, asking where to download games and asking for or providing help with pirated copies.\nDownloading a copy of the game that you own from the internet is still piracy (and you'll probably get a modified version that will not work anyway).\nIf you need instructions on how to dump your copy of the game, please read the quickstart guide http://rpcs3.net/quickstart"},{"explain":"rule 11","description":"Please do not come here to talk about RPCS3 in a negative manor, this includes punishments from the discord or reddit."},{"explain":"wiki","description":"You can find the wiki for Destiny 1 here: https://wiki.rpcs3.net/index.php?title=Destiny"},{"explain":"game patches","description":"Game Patches can be downloaded and enabled via RPCS3's Patch Manager.\nOpen RPCS3, then go to `Manage` > `Game Patches`. Download the latest patches then simply enable the patches you wish to use.\n\nFurther information and instructions regarding patches, including how to apply Custom/Canary patches, can be found here: https://wiki.rpcs3.net/index.php?title=Help:Game_Patches"}]